In [2]:
import numpy as np
import pandas as pd

Pandas Series

In [3]:
ser1 = pd.Series([1,2,3,4],['USA','Germany','USSR','Japan'])

In [4]:
ser2 = pd.Series([1,2,5,4],['USA','Germany','Italy','Japan'])

In [5]:
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [6]:
d ={0:'numpy',1:'pandas',2:'scikit',4:'tensorflow'}

In [7]:
dictser3 = pd.Series(d)

In [8]:
dictser3

0         numpy
1        pandas
2        scikit
4    tensorflow
dtype: object

In [9]:
dictser3[0]

'numpy'

In [10]:
ser1 + ser2

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

Pandas Dataframes

In [11]:
dat = np.random.randn(5,4)

In [12]:
df = pd.DataFrame(dat,['A','B','C','D','E'],['W','X','Y','Z'])

In [13]:
df

          W         X         Y         Z
A -0.871357  1.302950  1.037044 -1.019857
B  1.206920 -0.192026 -0.157159 -2.220132
C -0.541786 -0.271798  0.574393 -0.237263
D -0.895155  1.601590  0.804856 -0.768411
E  1.338510 -1.034395  0.357614  0.072114

In [14]:
type(df)

pandas.core.frame.DataFrame

In [15]:
type(df['W'])

pandas.core.series.Series

In [16]:
df['W']

A   -0.871357
B    1.206920
C   -0.541786
D   -0.895155
E    1.338510
Name: W, dtype: float64

In [17]:
df[['W','Z']]

          W         Z
A -0.871357 -1.019857
B  1.206920 -2.220132
C -0.541786 -0.237263
D -0.895155 -0.768411
E  1.338510  0.072114

In [18]:
df['new'] = df['W'] + df['Z']

In [19]:
df

          W         X         Y         Z       new
A -0.871357  1.302950  1.037044 -1.019857 -1.891214
B  1.206920 -0.192026 -0.157159 -2.220132 -1.013213
C -0.541786 -0.271798  0.574393 -0.237263 -0.779049
D -0.895155  1.601590  0.804856 -0.768411 -1.663566
E  1.338510 -1.034395  0.357614  0.072114  1.410624

In [20]:
df.drop('new',1,inplace=True)

In [21]:
df

          W         X         Y         Z
A -0.871357  1.302950  1.037044 -1.019857
B  1.206920 -0.192026 -0.157159 -2.220132
C -0.541786 -0.271798  0.574393 -0.237263
D -0.895155  1.601590  0.804856 -0.768411
E  1.338510 -1.034395  0.357614  0.072114

In [22]:
type(df.loc['A','W'])

numpy.float64

In [23]:
df.loc[['A','B']]

          W         X         Y         Z
A -0.871357  1.302950  1.037044 -1.019857
B  1.206920 -0.192026 -0.157159 -2.220132

In [24]:
df.iloc[:]

          W         X         Y         Z
A -0.871357  1.302950  1.037044 -1.019857
B  1.206920 -0.192026 -0.157159 -2.220132
C -0.541786 -0.271798  0.574393 -0.237263
D -0.895155  1.601590  0.804856 -0.768411
E  1.338510 -1.034395  0.357614  0.072114

In [25]:
booldf = df > 0

In [26]:
booldf

       W      X      Y      Z
A  False   True   True  False
B   True  False  False  False
C  False  False   True  False
D  False   True   True  False
E   True  False   True   True

In [27]:
df[df > 0]

         W        X         Y         Z
A      NaN  1.30295  1.037044       NaN
B  1.20692      NaN       NaN       NaN
C      NaN      NaN  0.574393       NaN
D      NaN  1.60159  0.804856       NaN
E  1.33851      NaN  0.357614  0.072114

In [28]:
df[(df['W']>0) & (df['Y']>0.3)]

         W         X         Y         Z
E  1.33851 -1.034395  0.357614  0.072114

In [29]:
df[(df['W']>0) | (df['Y']>0.3)]

          W         X         Y         Z
A -0.871357  1.302950  1.037044 -1.019857
B  1.206920 -0.192026 -0.157159 -2.220132
C -0.541786 -0.271798  0.574393 -0.237263
D -0.895155  1.601590  0.804856 -0.768411
E  1.338510 -1.034395  0.357614  0.072114

In [30]:
df.reset_index(inplace=True)

In [31]:
states = 'CA IL MO CO NC'.split()

In [32]:
df['States'] = states

In [33]:
df

  index         W         X         Y         Z States
0     A -0.871357  1.302950  1.037044 -1.019857     CA
1     B  1.206920 -0.192026 -0.157159 -2.220132     IL
2     C -0.541786 -0.271798  0.574393 -0.237263     MO
3     D -0.895155  1.601590  0.804856 -0.768411     CO
4     E  1.338510 -1.034395  0.357614  0.072114     NC

In [34]:
df.set_index('States',inplace=True)

In [35]:
df

       index         W         X         Y         Z
States
CA         A -0.871357  1.302950  1.037044 -1.019857
IL         B  1.206920 -0.192026 -0.157159 -2.220132
MO         C -0.541786 -0.271798  0.574393 -0.237263
CO         D -0.895155  1.601590  0.804856 -0.768411
NC         E  1.338510 -1.034395  0.357614  0.072114

In [36]:
df.drop('index',1,inplace=True)

In [37]:
df

               W         X         Y         Z
States
CA     -0.871357  1.302950  1.037044 -1.019857
IL      1.206920 -0.192026 -0.157159 -2.220132
MO     -0.541786 -0.271798  0.574393 -0.237263
CO     -0.895155  1.601590  0.804856 -0.768411
NC      1.338510 -1.034395  0.357614  0.072114

Group By in Pandas

In [38]:
data = {'Company':["MSFT","MSFT","GOOG","FB","FB","MSFT"],
       'Person':["Bob","Dylan","Arya","Ashley","Tom","Raymond"],
       'Sales':[200,350,150,400,100,200]}

In [39]:
data = pd.DataFrame(data)

In [40]:
data

  Company   Person  Sales
0    MSFT      Bob    200
1    MSFT    Dylan    350
2    GOOG     Arya    150
3      FB   Ashley    400
4      FB      Tom    100
5    MSFT  Raymond    200

In [41]:
byComp = data.groupby('Company')

In [44]:
byComp.sum()

         Sales
Company
FB         500
GOOG       150
MSFT       750

In [22]:
type(byComp.sum().loc['FB'])

pandas.core.series.Series

In [24]:
byComp.sum().loc['FB']['Sales']

500

In [20]:
byComp.describe()

        Sales
        count   mean         std    min    25%    50%    75%    max
Company
FB        2.0  250.0  212.132034  100.0  175.0  250.0  325.0  400.0
GOOG      1.0  150.0         NaN  150.0  150.0  150.0  150.0  150.0
MSFT      3.0  250.0   86.602540  200.0  200.0  200.0  275.0  350.0

Concatenating,Merging,Joining

df = pd.concat([df1,df2,df3])

df = pd.merge(left,right,how='inner',on='key')

df = left.join(right,how='inner')